In [19]:
# Importing Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [20]:
# Setting Path
path = r'/Users/pierremora/Desktop/08:20:2023 INSTACART BASKET ANALYSIS'

In [21]:
# Importing dataframe (customers.csv)
customers = pd.read_csv(r'/Users/pierremora/Desktop/08:20:2023 INSTACART BASKET ANALYSIS/Data/Original data/customers.csv', index_col = False)

# Descriptive analysis

In [22]:
customers.head(5)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [23]:
customers.shape

(206209, 10)

In [24]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [25]:
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [26]:
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [27]:
# Changing a variable data type ('user_id') in customers dataframe
customers['user_id']= customers['user_id'].astype('str')

In [28]:
customers.dtypes

user_id         object
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [29]:
# Renaming columns in orders dataframe
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)
customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)
customers.rename(columns = {'STATE' : 'state'}, inplace = True)
customers.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)
customers.rename(columns = {'income' : 'total_income'}, inplace = True)
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [30]:
# checking changes
customers.dtypes

user_id                 object
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependants     int64
fam_status              object
total_income             int64
dtype: object

# Data Consistency Checks

In [31]:
# checking for mixed types columns
for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [32]:
# Fixing mixed types in columns
customers['first_name'] = customers['first_name'].astype('str')

In [33]:
# Looking for missing values in the dataframe
customers.isnull().sum()

user_id                 0
first_name              0
last_name               0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
fam_status              0
total_income            0
dtype: int64

In [34]:
# Looking for full duplicates within my dataframe
customers_dups = customers[customers.duplicated()]

In [35]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependants, fam_status, total_income]
Index: []

In [36]:
# Dropping unncesesarry columns
customers = customers.drop(['date_joined'], axis = 1)

In [37]:
customers.head(1)

,user_id,first_name,last_name,gender,state,age,number_of_dependants,fam_status,total_income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665

# Merging Dataframe

In [38]:
# Importing previous dataframe

ords_prods_merged= pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'ords_prods_merged_sep_11.pkl'))

In [39]:
# shape dataframes
customers.shape

(206209, 9)

In [40]:
ords_prods_merged.shape

(32404859, 20)

In [41]:
# checking key have the same data type
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 9 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  object
 1   first_name            206209 non-null  object
 2   last_name             206209 non-null  object
 3   gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int64
 6   number_of_dependants  206209 non-null  int64
 7   fam_status            206209 non-null  object
 8   total_income          206209 non-null  int64
dtypes: int64(3), object(6)
memory usage: 14.2+ MB

In [42]:
ords_prods_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 20 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   number_of_orders        int32
 3   order_day_of_week       int8
 4   order_hour_of_day       int16
 5   days_since_prior_order  float64
 6   product_id              object
 7   product_name            object
 8   department_id           int16
 9   prices                  float64
 10  price_range_loc         object
 11  busiest_day             object
 12  busiest_days            object
 13  busiest_period_of_day   object
 14  max_order               float64
 15  loyalty_flag            object
 16  avg_price               float64
 17  spending_flag           object
 18  median_order_day        float64
 19  frequency_flag          object
dtypes: float64(5), int16(2), int32(1), int8(1), object(11)
memory usage: 4.1+ GB

In [12]:
# changing dtype of 'user_id' on the ords_prods_merged dataframe
ords_prods_merged['user_id']= ords_prods_merged['user_id'].astype('str')

In [43]:
#checking changes
ords_prods_merged.dtypes

order_id                   object
user_id                    object
number_of_orders            int32
order_day_of_week            int8
order_hour_of_day           int16
days_since_prior_order    float64
product_id                 object
product_name               object
department_id               int16
prices                    float64
price_range_loc            object
busiest_day                object
busiest_days               object
busiest_period_of_day      object
max_order                 float64
loyalty_flag               object
avg_price                 float64
spending_flag              object
median_order_day          float64
frequency_flag             object
dtype: object

In [ ]:
# merging dataframe
ords_prods_cust_merged = customers.merge(ords_prods_merged, on = 'user_id', indicator= True)

In [30]:
ords_prods_cust_merged.head(5)

,user_id,first_name,last_name,gender,state,age,number_of_dependants,fam_status,total_income,product_id,...,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,median_order_day,frequency_flag,_merge
0,51,Stephanie,Jensen,Female,Wyoming,37,1,married,71190,48745,...,Mid_range product,Busiest days,Most Orders,99,Loyal customer,10.596831,High Spender,7.0,frequent_customer,both
1,51,Stephanie,Jensen,Female,Wyoming,37,1,married,71190,38944,...,Low_range product,Busiest days,Most Orders,99,Loyal customer,10.596831,High Spender,7.0,frequent_customer,both
2,51,Stephanie,Jensen,Female,Wyoming,37,1,married,71190,16589,...,Low_range product,Busiest days,Most Orders,99,Loyal customer,10.596831,High Spender,7.0,frequent_customer,both
3,51,Stephanie,Jensen,Female,Wyoming,37,1,married,71190,20887,...,Mid_range product,Regularly busy,Most Orders,99,Loyal customer,10.596831,High Spender,7.0,frequent_customer,both
4,51,Stephanie,Jensen,Female,Wyoming,37,1,married,71190,14633,...,Low_range product,Regularly busy,Average Orders,99,Loyal customer,10.596831,High Spender,7.0,frequent_customer,both

In [31]:
# exporting dataframe to pickle
# Export data to pkl

ords_prods_cust_merged.to_pickle(os.path.join(path, 'Data','Prepared Data', 'ords_prods_cust_merged.pkl'))